<script setup>

import Layout from "@/Layouts/Layout.vue";
import route from "ziggy-js";
</script>

<template>
  <Layout>
    <div class="grid grid-cols-1 md:grid-cols-12">

      <aside class="p-4 flex flex-col gap-1 h-fit md:sticky md:top-0 col-span-3 bg-neutral-800 md:h-[100dvh] rounded-2xl">
        <a
          class="link link-info"
          href="#Начало"
        >
          Начало
        </a>
        <a
          class="link link-info"
          href="#О языке"
        >
          О языке
        </a>
        <a
          class="link link-info"
          href="#Фонетика"
        >
          Фонетика
        </a>
        <a
          class="link link-info"
          href="#Орфография"
        >
          Орфография
        </a>
        <a
          class="link link-info"
          href="#Грамматика"
        >
          Грамматика
        </a>
        <a
          class="link link-info"
          href="#Словарь"
        >
          Словарь
        </a>
        <a
          class="link link-info"
          href="#Статьи"
        >
          Статьи
        </a>
      </aside>

      <div class="p-4 flex flex-col gap-6 mb-[50vh] col-span-9">

        <article id="Начало">
          <h3 class="text-xl font-bold">
            Начало
          </h3>
          <p>
            Добро пожаловать, дорогие пользователи. Здесь вы можете получить информацию о том как пользоваться Ёрданом.
          </p>
          <p>
            Если вам нужно посмотреть язык, то вы можете найти его на странице <a class="link link-info" target="_blank" :href="route('languages')">все языки</a>.
            Или найти его на <a class="link link-info" target="_blank" :href="route('main')">главной странице</a>. А можете получить ссылку от друга.
          </p>
          <br>

          <p>
            Но самое главное что вы можете сделать на главной странице: создать язык, нажав на кнопку "Добавить язык".
            <img
              class="rounded-2xl border"
              src="/storage/info_images/10.png"
              alt="Добавить язык"
            >
            После нажатия вы увидите модальное окно, где вам предложат ввести название языка.
            Старайтесь использовать нормальные названия для ваших языков и не используйте оскорбительные фразы.
            <br>
            <img
              class="rounded-2xl border"
              src="/storage/info_images/15.png"
              alt="Добавить язык"
            >
            Когда вы введёте название, нажмите зелёную кнопку "Добавить". Самое главное было сделано.
          </p>
        </article>

        <article id="О языке">
          <h3 class="text-xl font-bold">О языке</h3>

          <p>
            После выполнения вышеуказанных действий вы попадаете на страницу о языке.
            <img
              class="rounded-2xl border"
              src="/storage/info_images/20.png"
              alt="О языке"
            >
            Тут вам будут показываться подсказки по заполнению вашего языка по порядку.
            <img
              class="rounded-2xl border"
              src="/storage/info_images/25.png"
              alt="О языке"
            >
            В них вы по очереди заполняете поля. Или можете перейти в режим редактирования и сразу всё изменить.
            <br>
            В полях вы можете использовать все доступные вам символы юникода.
            <br>
            <img
              class="rounded-2xl border"
              src="/storage/info_images/27.png"
              alt="О языке"
            >
            А когда будете заполнять транскрипцию, то вам доступна очень удобная фича конвертации X-SAMPA в IPA.
            Советую вам изучить <a class="link link-info" target="_blank" href="https://en.wikipedia.org/wiki/X-SAMPA">вики по X-SAMPA</a>.
            Вы быстро запомните необходимые в вашем языке символы.
            Но осторожнее, пока тут присутствуют баги, к сожалению, конвертация процесс не настолько лёгкий, чтобы быть
            без багов.
            <br>
            Введя в поле транскрипции "Z@Lan" и нажав заветную кнопку, вы получите "ʒəʎan".
          </p>
          <img
            class="rounded-2xl border"
            src="/storage/info_images/29.png"
            alt="О языке"
          >
          <p>
            У вас есть возможность добавить флаг вашего языка, для этого сверху есть заметная кнопка.
          </p>
          <p>
            Поле тип языка оставлено полностью на вашу совесть. Вы можете туда написать что угодно.
            Но на помощь вам есть несколько подсказок из которых вы можете выбрать что вам подходит.
          </p>
          <p>
            Статус языка говорит о степени завершённости вашего языка. Если вы только начали заполнять всё о вашем
            языке,
            то оставьте статус "Новый". Если вы заполнили другие разделы, но языку есть куда расти, то ставьте "В
            процессе".
            Ну и статус "Завершён" покажет другим людям, что в языке уже не будет критичных изменений.
          </p>
          <p>
            Ниже расположен блок для написания статьи в markdown. Блок "О языке" будет виден всем,
            кто зайдёт на страницу вашего языке. Здесь вы можете указать любую информацию.
            Рассказать о носителях вашего языка, дать краткую характеристику, написать примеры и что ещё можете
            придумать.
          </p>
          <br>

          <p>
            Когда вы всё заполнили, вернитесь вверх страницы и нажмите кнопку "Сохранить".
            Вы не только сохраните данные, но и вернётесь на страницу просмотра.
          </p>
          <img class="rounded-2xl border"
               src="/storage/info_images/40.png"
               alt="О языке">
          <p>
            Вы попали на страницу, которую видят и другие люди, т.е. вы вышли из режима редактирования страницы.
            Как разработчик и главный по своему языку вы видите следующие подсказки по заполнению.
            Кнопки или открывают модалки, или переводят на страницу где можно сделать то что просят.
          </p>
        </article>

        <article id="Фонетика">
          <h3 class="text-xl font-bold">Фонетика</h3>

          <p>
            В разделе Фонетика есть не два режима, а целых три. Просмотр, изменение и добавление.
            <br>
            Пока вы только создали язык и ничего не делали просмотр и изменение бесполезны, там будет пусто,
            только кнопки переключения режимов, да предложение написать статью.
            <img
              class="rounded-2xl border"
              src="/storage/info_images/50.png"
              alt="Фонетика"
            >
            <br>
            Вам в первую очередь надо добавить звуки, для этого надо перейти в режим добавления,
            нажав кнопку плюс-минус.
          </p>
          <p>
            <img
              class="rounded-2xl border"
              src="/storage/info_images/60.png"
              alt="Фонетика"
            >
            В этом режиме вы видите множество предустановленных звуков, тех которые наиболее распространены.
            Кликнув на нужный звук вы добавите его в свой язык. Он окрасится в зелёный, значит всё успешно добавлено.
            Повторный клик удалит звук.
          </p>
          <p>
            <img
              class="rounded-2xl border"
              src="/storage/info_images/70.png"
              alt="Фонетика"
            >
            Однако если вам вдруг недостаточно предустановленных звуков, то у вас есть возможность добавить свой.
            Инструкция написана внизу в режиме добавления.
            Для этого есть кнопка сверху "Добавить свой звук".
            Это позволяет сделать даже свою фонетическую систему.
            Хотя понимаю, что добавление сделано пока не очень удобно.
          </p>
          <p>
            Когда вы нажмёте кнопку "Сохранить", вернувшись в режим просмотра, вы увидите таблицы из добавленных
            вами звуков.
            <img
              class="rounded-2xl border"
              src="/storage/info_images/80.png"
              alt="Фонетика"
            >
            Теперь вы можете нажать кнопку с карандашом для перехода в режим редактирования.
            В этом режиме вы можете указать какие звуки являются аллофонами.
            Для этого нужно нажмать на нужный звук и в открывшемся модальном окне выбрать звук, аллофоном которого
            является тот на который вы нажмали.
            <img
              class="rounded-2xl border"
              src="/storage/info_images/90.png"
              alt="Фонетика"
            >
            В таблице это изменит отображение. Вы и другие люди будут видеть, что звук, указанный в квадратных скобках
            не сам по себе, а аллофон того, что указан в косых чертах.
          </p>
          <p>
            В режиме просмотра же вы уже ничего не сможете изменять, а даже можете выделить звук и скопировать, если вам
            это нужно.
          </p>
        </article>

        <article id="Орфография">
          <h3 class="text-xl font-bold">Орфография</h3>

          <p>
            Раздел орфография нужен, чтобы сообщить другим людям то как записывается ваш язык.
            Пока здесь нет поддержки ваших конскриптов, поэтому пока что только юникодные символы.
            Но советую использовать латиницу или кириллицу, чтобы другим людям было удобнее.
            Но помните, в первую очередь это ваш инструмент, главное чтобы прочесть могли вы сами.
            <br>
            Ну и здесь же можно заполнить таблицу произношения ваших букв.
          </p>
          <img
            class="rounded-2xl border"
            src="/storage/info_images/100.png"
            alt="Орфография"
          >
          <p>
            В режиме редактирования, когда вы ещё ничего не заполняли у вас есть лишь одна кнопка (кроме кнопки назад),
            это плюсик для добавления орфографемы.
            <img
              class="rounded-2xl border"
              src="/storage/info_images/110.png"
              alt="Орфография"
            >
            Здесь вы обязаны ввести символ для маленькой буквы и можете ввести необязательный символ для большой буквы.
            Пока нет автоматики, чтобы большая подтягивалась автоматически, но возможно этот функционал добавится позже.
            <br>
            Вы можете вводить не только одиночные символы, но и диграфы, триграфы и т.д.
            Это позволит удобнее описывать произношения.
            <br>
            Так же у вас есть возможность снять галочку с пункта "Входит в алфавит".
            На данный момент ни на что не влияет, но потом орфографемы с галочкой будут использованы для
            сортировки словаря по вашему порядку алфавита.
          </p>
          <img
            class="rounded-2xl border"
            src="/storage/info_images/120.png"
            alt="Орфография"
          >
          <p>
            Добавляя орфографемы, они появляются квадратиками в строчки. Вы можете вручную
            перетаскиванием квадратиков за три точки поменять порядок орфографем.
            <br>
            А в таблице ниже вы можете добавить произношение. Для этого нажмите на плюсик напротив нужной орфографемы.
          </p>
          <img
            class="rounded-2xl border"
            src="/storage/info_images/130.png"
            alt="Орфография"
          >
          <p>
            При этом у одной орфографемы может быть не одно произношение.
          </p>
          <img
            class="rounded-2xl border"
            src="/storage/info_images/140.png"
            alt="Орфография"
          >
          <p>
            Каждому такому произношению вы можете добавлять условия при которых они выполняются.
          </p>
          <p>
            На данный момент туда вы можете записать что угодно. От псевдоязыка типа "V_V" или "N_#" до
            простого описания языком.
            <br>
            Когда я начну делать автотранскрипцию, то придётся разработать язык описания условий и он будет здесь
            описан.
          </p>
        </article>

        <article id="Грамматика">
          <h3 class="text-xl font-bold">Грамматика</h3>

          <p>
            Следующий раздел, который вам стоит заполнить это Грамматика.
            Это множество всех ваших грамматических категорий в языке. Сюда следует отнести часть речи,
            число, лицо, склонение, падеж, вид, время и т.д. и т.п.
            <br>
            На данный момент нет никаких предустановленных категорий и их значений, поэтому всё придётся
            заполнять вам вручную. В будущем появится возможность выбрать категории и значения из предложенного
            списка, где так же будут подготовлены описания.
          </p>
          <img
            class="rounded-2xl border"
            src="/storage/info_images/160.png"
            alt="Грамматика"
          >
          <p>
            На этой странице вы можете заполнить статью, описывающую вашу грамматику в общем, словами.
            Ну и добавить сами категории. Для этого есть заветная кнопка "Добавить" для первой
            и плюсик в режиме редактирования для последующих.
          </p>
          <img
            class="rounded-2xl border"
            src="/storage/info_images/170.png"
            alt="Грамматика"
          >
          <img
            class="rounded-2xl border"
            src="/storage/info_images/180.png"
            alt="Грамматика"
          >
          <p>
            После добавления категории она появится в списке. Можно так же открыть
            окно редактирования на кнопку карандаша рядом с названием категории
            в режиме редактирования раздела Грамматика.
            Чтобы изменить название категории или статью описания.
            Что категория обозначает и как соотносится с другими категориями.
          </p>
          <img
            class="rounded-2xl border"
            src="/storage/info_images/190.png"
            alt="Грамматика"
          >
          <p>
            Ну и самое главное это добавить значения.
            Для этого есть плюсик внутри карточки грамматики под названием и статьёй.
            Если у вас категория Часть речи, то значениями могут быть
            существительное, глагол, прилагательное, ну или cmavo, cmevla, sumti, selbri.
            <br>
            Помимо названия значения категории обязательно нужно указать его краткое обозначение.
            Именно оно будет показываться вам в словаре рядом со словами. Например, A для прилагательного,
            N для существительного, SG для единственного числа, и ACC для винительного падежа.
          </p>
          <p>
            Ну и добавьте описание категории, чтобы люди могли понять о чём она.
          </p>
        </article>

        <article id="Словарь">
          <h3 class="text-xl font-bold">Словарь</h3>

          <p>
            Ну и самое основное, что есть у нас это словарь.
          </p>
          <img
            class="rounded-2xl border"
            src="/storage/info_images/210.png"
            alt="Словарь"
          >
          <p>
            Пока вы ничего не добавляли он будет выглядеть пустым. Но как у главного по языку у вас есть кнопка
            "Добавить вокабулу" рядом с поиском.
          </p>
          <p>
            В данном словаре используется разделения понятий вокабула и лексема. Вокабула это просто как звучит
            слово, его написание и ничего больше. Вокабула не имеет смысла. Смысл вокабуле даёт лексема.
            У одной вокабулы может быть множество разных лексем, каждая со своими оттенками смыслов,
            а может и с разной грамматикой.
          </p>
          <img
            class="rounded-2xl border"
            src="/storage/info_images/220.png"
            alt="Словарь"
          >
          <p>
            Добавляя вокабулу вы должны указать её написание и её звучание. В помощь для транскрипции есть
            кнопка конвертации X-SAMPA в IPA.
          </p>
          <img
            class="rounded-2xl border"
            src="/storage/info_images/223.png"
            alt="Словарь"
          >
          <img
            class="rounded-2xl border"
            src="/storage/info_images/226.png"
            alt="Словарь"
          >
          <p>
            Здесь же можно добавить общую грамматику и первую лексему.
            Обратите внимание на галочку "Применить ко всем будущим лексемам".
            Оно позволит добавить грамматику в блок общей информации, применимой ко всем лексемам.
            Если вы добавляете слово у которого будут и другие грамматики у других лексем, убирайте галочку.
          </p>
          <img
            class="rounded-2xl border"
            src="/storage/info_images/230.png"
            alt="Словарь"
          >
          <p>
            Когда вы добавите вокабулу вам откроется окно её редактирования.
            Вы можете изменить саму вокабулу, если допустили ошибку или хотите изменить её.
          </p>
          <p>
            Но вся магия начинается ниже. С добавлением вокабулы автоматически добавляется одна дополнительная лексема.
            Общая, в которой вы можете написать общую информацию о слове, например грамматику, чтобы не
            приходилось указывать у каждого значения весь набор одинаковой грамматики.
            Заполнять статьи и короткое значение общей лексемы необязательно.
            <img
              class="rounded-2xl border"
              src="/storage/info_images/240.png"
              alt="Словарь"
            >

            <br>
            И помимо общей лексемы, если вы поставили галочку, создаётся лексема 1.1,
            в которой и стоит указывать первое значение слова, оно обычно самое главное и частое.
            <br>
            Старайтесь разбивать значения слова по лексемам, а не записывать все, даже метафоричные в одну.
            <br>
            Для этого вы можете добавлять и другие лексемы вручную.
          </p>
          <img
            class="rounded-2xl border"
            src="/storage/info_images/245.png"
            alt="Словарь"
          >
          <p>
            Для заполнения грамматики лексемы нажмите кнопку "Грамматика" в окне редактирования лексемы.
            Откроется окно с чекбоксами ваших грамматических значений, которые вы вводили в разделе Грамматика.
            Так же при добавлении лексемы можно сразу указать нужную грамматику.
            <br>
            Грамматическое значение у лексемы может быть неизменяемым и изменяемым. Чтобы показать, что оно
            изменяемое, нажмите чекбокс "изменяемое" после того как вы выделите само значение.
            <br>
            Порядок показывания грамматики определяется порядком в котором вы прожимали чекбоксы.
          </p>
          <p>
            Заполняя значения лексемы старайтесь обязательно указывать короткое значение, а все тонкости смысла
            расписать уже в статье. В ней вы можете даже использовать markdown.
          </p>
          <img
            class="rounded-2xl border"
            src="/storage/info_images/250.png"
            alt="Словарь"
          >
          <img
            class="rounded-2xl border"
            src="/storage/info_images/260.png"
            alt="Словарь"
          >
          <p>
            Ну и ещё одна фича, которую предоставляет вам словарь на данный момент это связи слов.
            В окошке добавления связи вы в поиск вводите слово, и из списка ниже выбираете то что вам нужно,
            помните, что вы выбираете лексему, а не вокабулу. Поэтому если у вас связь целых слов, а не
            конкретных значений, используйте для этого лексемы 0.0 (общие).
            <br>
            И так же вы должны указать тип связи. Например "форма слова", "синонимы", "другие цвета" и что
            вы сможете придумать. В одном типе, или точнее категории, может быть много связанных слов.
            Так вы можете указывать супплетивные формы слова, внося их в словарь, просто синонимы, антонимы, так
            и что-то что вы сможете ещё придумать.
          </p>
        </article>

        <article id="Статьи">
          <h3 class="text-xl font-bold">Статьи</h3>

          <p>
            Помимо прочего на сайте представлен функционал создания статей. Здесь вы можете описывать
            особенности своей грамматики как вам душе угодно. Рассказывать про различия глаголов быть,
            описывать как соотносятся ваши прилагательные с остальными словами и всё что хотите про ваш язык.
          </p>
          <img
            class="rounded-2xl border"
            src="/storage/info_images/280.png"
            alt="Статьи"
          >
          <p>
            Для добавления статьи есть кнопка. И вам в окне надо ввести название вашей статьи.
          </p>
          <img
            class="rounded-2xl border"
            src="/storage/info_images/290.png"
            alt="Статьи"
          >
          <img
            class="rounded-2xl border"
            src="/storage/info_images/300.png"
            alt="Статьи"
          >
          <p>
            Статьи в отличие от всего остального имеет функционал выкладки и пока статья не опубликована
            её видите только вы и никто больше.
          </p>
          <p>
            Помимо названия и самой статьи у неё можно указывать теги, по которым потом будет удобнее искать
            статьи.
          </p>
          <p>
            Markdown позволяет использовать не только свою облегчённую разметку, но и полноценные html теги,
            поэтому у вас в распоряжении для наведения красоты есть весь интернет с уроками как сделать ту или
            иную вещь. Например, таблицу. Но если у вас в таблице не планируется объединённых ячеек и других
            изяществ, используйте таблицы markdown'а.
          </p>
        </article>
      </div>
    </div>
  </Layout>
</template>

<style scoped>
  img {
      margin-bottom: 0.5em;
      margin-top: 0.5em;
  }
</style>